In [1]:
import pandas as pd

In [22]:
data = {
    'name' : ['Al', 'Arian', 'Ahris', 'Aave'],
    'age' : [24,12,52,44],
    'location' : ['allentown', 'philadelphia', 'new jersey', 'new york']
}

In [23]:
df = pd.DataFrame(data)

In [24]:
df

    name  age      location
0     Al   24     allentown
1  Arian   12  philadelphia
2  Ahris   52    new jersey
3   Aave   44      new york

In [33]:
test_list = ['this', 'is', 'a', 'test']

first_letters = ['i','t','t','a']

[letter+lis[1:] for letter,lis in zip(first_letters,test_list)]

['ihis', 'ts', 't', 'aest']